Linux/LinuxOS/etc.issue.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>/etc/issue,/etc/issue.net,/etc/motd 登陆显示信息</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="/etc/issue,/etc/issue.net,/etc/motd 登陆显示信息"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-02 00:33:19 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#linuxos">主页</a><br/><a href="#disqus_thread">评论</a></div>


</head>
<body>


<div id="content">
<h1 class="title">/etc/issue,/etc/issue.net,/etc/motd 登陆显示信息</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>



<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 /etc/issue文件</a></li>
<li><a href="#sec-2">2 实例</a></li>
<li><a href="#sec-3">3 Ubuntu查看操作系统版本</a></li>
<li><a href="#sec-4">4 /etc/issue.net</a></li>
<li><a href="#sec-5">5 /etc/motd文件</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> /etc/issue文件</h2>
<div class="outline-text-2" id="text-1">

<p>/etc/issue是个纯文本文件，其内容为登陆tty时显示的信息。<br/>
</p>
<p>
可以用换码符来显示需要的信息，换码符的意义是由agetty来解释的，man agetty查看更多的信息。<br/>
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">\b</td><td class="left">插入当前行的波特率</td></tr>
<tr><td class="left">\d</td><td class="left">插入当前日期</td></tr>
<tr><td class="left">\s</td><td class="left">插入操作系统的名称</td></tr>
<tr><td class="left">\l</td><td class="left">插入当前tty的名称</td></tr>
<tr><td class="left">\m</td><td class="left">插入计算机的体系结构id，如i486</td></tr>
<tr><td class="left">\n</td><td class="left">插入计算机的节点名，即hostname</td></tr>
<tr><td class="left">\o</td><td class="left">插入计算机的域名</td></tr>
<tr><td class="left">\r</td><td class="left">插入内核的版本</td></tr>
<tr><td class="left">\t</td><td class="left">插入当前时间</td></tr>
<tr><td class="left">\u</td><td class="left">插入当前登陆的用户数</td></tr>
<tr><td class="left">\U</td><td class="left">插入1                           user  或者  N   users，N是当前登陆的用户数</td></tr>
<tr><td class="left">\v</td><td class="left">插入当前操作系统的版本</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 实例</h2>
<div class="outline-text-2" id="text-2">

<p>  我现在机子上用cat /etc/issue得到结果是：<br/>
</p>


<pre class="example">kernel_study$ cat /etc/issue
Ubuntu 11.04 \n \l

</pre>

<p>
  \n表示显示hostname，\l表示显示tty名称。此时Control+Alt+F1登陆到tty1终端上，可以看到显示的是Ubuntu 11.04 visaayfan@compaq-510 tty1。<br/>
  下面修改/etc/issue为 Ubuntu 11.04 \n \l \v \t \m，再次Ctrl+Alt+F1切换到tty1上，按下Ctrl+D，此时会看到增加了当前操作系统版本、时间和当前计算机体系结构名称。<br/>
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Ubuntu查看操作系统版本</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Ubuntu操作系统默认情况下issue文件里写的是OS的版本，故可以通过查看此文件来得知当前Ubuntu版本（如果没被人修改的话）。<br/>
</li>
<li>还可以 cat /etc/lsb-release<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> /etc/issue.net</h2>
<div class="outline-text-2" id="text-4">

<p>  通过telnet远程登陆主机显示的信息显示的是/etc/issue.net而非/etc/issue<br/>
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> /etc/motd文件</h2>
<div class="outline-text-2" id="text-5">

<p>  /etc/issue是登陆前显示的信息，而/etc/motd是登陆后显示的信息。<br/>
  Ubuntu下/etc/motd是/var/run/motd的符号链接，实际上是由脚本/etc/update-motd.d/00header来控制的。<br/>
  可以修改/etc/update-motd.d中的文件来得到想要的登陆后提示界面。<br/>
<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</p></div>
</div>
</div>

</body>
</html>
